// @ts-nocheck
import { PrivacyPolicy } from 'pages/PrivacyPolicyPage'
import { PrivacyItem } from 'pages/PrivacyPolicyPage/PrivacyPolicyList/PrivacyPolicyList'

export const privacyPolicyListMock: PrivacyItem[] = [
  {
    id: 1,
    title: 'Общие положения',
    text: [
      `Настоящая политика конфиденциальности в отношении обработки персональных данных (далее – «Политика») составлена в соответствии с требованиями законодательства и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных со стороны Общества с ограниченной ответственностью «Транспортно-туристическая компания МерЛайнс» (далее – «Оператор»).`,
      `Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.`,
      `Настоящая Политика применяется ко всей информации, которую Оператор может получить о посетителях Сервиса. Используя Сервис и предоставляя свои персональные данные Оператору, Пользователь дает согласие на обработку персональных данных в соответствии с данной Политикой, подтверждает, что ознакомлен со всеми пунктами настоящей Политики и принимает их без исключений и оговорок.`,
    ],
  },
  {
    id: 2,
    title: 'Основные понятия, используемые в Политике',
    text: [
      `Сервис – интернет-ресурс, располагаемый по сетевому адресу <a href="https://merlines.ru">https://merlines.ru</a>, администрируемый Оператором. Сервис имеет десктопную и  мобильную версию в форме приложения «Merlines», предназначенное для работы на смартфонах, планшетах, других мобильных устройствах и опубликованное в Google Play и App Store. Право собственности на Сервис принадлежит Оператору.`,
      `Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.`,
      `Оператор – ООО «Транспортно-туристическая компания МерЛайнс», самостоятельно или совместно с другими лицами организующее и (или) осуществляющее обработку персональных данных, а также определяющий цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.`,
      `Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю Сервиса.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Услуги – услуги, оказываемые Оператором посредством Сервиса (услуги по поиску Пользователем билетов на авиа, железнодорожный и автобусный транспорт в РФ и зарубежье с предоставлением последующей возможности забронировать и оплатить их через продавцов (агентства, авиакомпании, сервисы бронирования, напрямую у перевозчиков). Полная информация об Услугах указана на Сервисе.`,
      `Файл «cookie» - файл, который сохраняется на компьютере или мобильном устройстве Пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего Сервиса.`,
    ],
  },
  {
    id: 3,
    title:
      'Персональные данные Пользователя, которые обрабатывает Оператор',
    text: [
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
    ],
  },
  {
    id: 4,
    title: 'Цели обработки персональных данных',
    text: [
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
    ],
  },
  {
    id: 5,
    title:
      'Согласие Пользователя. Правовые основания обработки персональных данных.',
    text: [
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
    ],
  },
  {
    id: 6,
    title:
      'Безопасность, порядок и условия сбора, хранения, передачи и других видов обработки персональных данных',
    text: [
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
    ],
  },
  {
    id: 7,
    title: 'Ответственность',
    text: [
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
    ],
  },
  {
    id: 8,
    title: 'Заключительные положения',
    text: [
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
      `Пользователь – посетитель Сервиса, заказавший и/или планирующий заказать и/или заказывающий Услуги у Оператора.`,
    ],
  },
]

export const privacyPolicyPageMock: PrivacyPolicy = {
  pageTitle: `ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ <br>в отношении обработки персональных данных`,
  publicationDate: 'Дата публикации: « 25 » Марта, 2021 г.',
  privacyList: privacyPolicyListMock,
}
